using System;
//1. а) Дописать структуру Complex, добавив метод вычитания комплексных чисел.
//Продемонстрировать работу структуры.
//б) Дописать класс Complex, добавив методы вычитания и произведения чисел.Проверить
//работу класса.
//в) Добавить диалог с использованием switch демонстрирующий работу класса.
//    Рощупкин
namespace hw3task1
{
    class Program
    {
        static void Main(string[] args)
        {
            Complex.Demonsration();
            Console.ReadLine();
        }
    }
}
